test/vcr_cassettes/transaction/capture_partial.yml

---
http_interactions:
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?amount=25.0&ccexp=1025&ccnumber=<CREDIT_CARD>&currency=USD&cvv=<CVV>&email=john@example.com&first_name=John&last_name=Doe&payment=creditcard&security_key=<NMI_SECURITY_KEY>&test_mode=enabled&type=auth
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:29:58 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '1235'
      X-Volterra-Location:
      - b-dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=11386673856&avsresponse=&cvvresponse=M&orderid=&type=auth&response_code=100
  recorded_at: Thu, 20 Nov 2025 23:29:59 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?amount=10.0&currency=USD&payment=creditcard&security_key=<NMI_SECURITY_KEY>&test_mode=enabled&transactionid=11386673856&type=capture
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:29:59 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '1093'
      X-Volterra-Location:
      - dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=11386673856&avsresponse=&cvvresponse=&orderid=&type=capture&response_code=100
  recorded_at: Thu, 20 Nov 2025 23:30:00 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?amount=25.0&ccexp=1025&ccnumber=<CREDIT_CARD>&currency=USD&cvv=<CVV>&email=john@example.com&first_name=John&last_name=Doe&payment=creditcard&security_key=<NMI_SECURITY_KEY>&test_mode=enabled&type=auth
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 21 Nov 2025 05:02:01 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '1175'
      X-Volterra-Location:
      - b-dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=11387273135&avsresponse=&cvvresponse=M&orderid=&type=auth&response_code=100
  recorded_at: Fri, 21 Nov 2025 05:02:02 GMT
recorded_with: VCR 6.3.1
