test/vcr_cassettes/transaction/charge_vaulted_customer.yml

---
http_interactions:
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?address1=456%20Oak%20Ave&ccexp=1225&ccnumber=4111111111111111&city=Los%20Angeles&country=US&currency=USD&customer_vault=add_customer&cvv=999&email=jane@example.com&first_name=Jane&last_name=Smith&payment=creditcard&phone=555-555-1234&security_key=6457Thfj624V5r7WUwc5v6a68Zsd6YEm&state=CA&test_mode=enabled&zip=90001
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 29 Oct 2025 21:12:16 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '514'
      Set-Cookie:
      - '068303=/qKSywKkv/4y64Ek8bYzg7r8UTYXnA3r2Vooz+nZfYhOQ7Yx3laOKnNR7p4n78nBFhMWetfU8oq+jDNTkBOtnbqkcvk6TgN1wo0fcaMqq1ZUU4GY9NF8Z0oeCVdtpiZ2nYIxUc+2YLtpEOLWXU1nfVYcMUg9pvaTVQPM5z6cZ3PVKqew;
        path=/'
      X-Volterra-Location:
      - wes-sea
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&customer_vault_id=1071085843
  recorded_at: Wed, 29 Oct 2025 21:12:16 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?amount=25.0&currency=USD&customer_vault_id=1071085843&orderid=VAULT-ORDER-456&payment=creditcard&security_key=6457Thfj624V5r7WUwc5v6a68Zsd6YEm&test_mode=enabled&type=sale
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 29 Oct 2025 21:12:17 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '1561'
      Set-Cookie:
      - '068303=Gh3C9Gs4GkxFGXq1DTLEiUh78d95ZgVKEXElRXd/N7KggSgGXBcMtUPDLYyeoUWqwwYKaBM5Sw3EKxDiTmq6o9xYbN3ZjMcbnUSBEmwvfiYPVvzF/PNEaIVc/Q+wxEjKGwdW4yvtwCKO8VWIjS/qIXikyHJ1HvMkSVU1uC+EEurP9h9z;
        path=/'
      X-Volterra-Location:
      - wes-sea
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=11304356579&avsresponse=N&cvvresponse=&orderid=VAULT-ORDER-456&type=sale&response_code=100&customer_vault_id=1071085843
  recorded_at: Wed, 29 Oct 2025 21:12:18 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&customer_vault=delete_customer&customer_vault_id=1071085843&payment=creditcard&security_key=6457Thfj624V5r7WUwc5v6a68Zsd6YEm&test_mode=enabled
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 29 Oct 2025 21:12:18 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '470'
      Set-Cookie:
      - '068303=Vfe57ZwXclMNPdEAOnxZ/TBpM/rSAFqA7aaN53psI72EGFhv281iYb+iHHzPh5OWUG0BXg1mTix54yBz9w/7du0Vfna45+Z2x58IHCxfMIkUFFNk1W9fRWjqZqdRRJqp5EaKad/e/oFROJZhH1BU3SMK4/S4/lJeTifFElgE9F0pRu0e;
        path=/'
      X-Volterra-Location:
      - wes-sea
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Deleted&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100
  recorded_at: Wed, 29 Oct 2025 21:12:18 GMT
recorded_with: VCR 6.3.1
