test/vcr_cassettes/transaction/refund_partial.yml

---
http_interactions:
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?address1=123%20Main%20St&amount=10.0&ccexp=1225&ccnumber=4111111111111111&city=Beverly%20Hills&country=US&currency=USD&cvv=999&email=john@example.com&first_name=John&last_name=Doe&payment=creditcard&phone=555-555-5555&security_key=6457Thfj624V5r7WUwc5v6a68Zsd6YEm&state=CA&test_mode=enabled&type=sale&zip=90210
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 29 Oct 2025 21:12:59 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '1205'
      Set-Cookie:
      - '068303=OtpPvfFBFdNvs6+f7Q4nJ7UJQGT2mndm0wZsb3775pwJ4Wk0mqMvqvElWxwDK0IYFxqDQNBN23jzYfmCt8BKsELzspK+yjY4pIrSWD6wekCtD4bZCzEyoBhqqXOtnTc4sLvLFVy3klIiXomsaGqHhoTsj7VhmbSGxvVtfBv4ILDFdE5L;
        path=/'
      X-Volterra-Location:
      - wes-sea
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=11304358970&avsresponse=N&cvvresponse=M&orderid=&type=sale&response_code=100
  recorded_at: Wed, 29 Oct 2025 21:13:00 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?amount=5.0&currency=USD&payment=creditcard&security_key=6457Thfj624V5r7WUwc5v6a68Zsd6YEm&test_mode=enabled&transactionid=11304358970&type=refund
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 29 Oct 2025 21:13:00 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '1936'
      Set-Cookie:
      - '068303=YhA1EBLlgEMZPnEcYeJaUceN/9DD0LYWOn/2HFhhEr3Ao2P6YjgGN7KYSLpntTR2DST6Gnk9OO4VgV5r54M8RVSWdxZebzsO1Xkvmp02DJ3k8Omau4X0u07pmNG7KfjrNBCQKgdUfybNdyK25SEYbyetQg79+PELeoE5MyWnfr299Au0;
        path=/'
      X-Volterra-Location:
      - wes-sea
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=SUCCESS&authcode=&transactionid=11304359053&avsresponse=&cvvresponse=&orderid=&type=refund&response_code=100
  recorded_at: Wed, 29 Oct 2025 21:13:02 GMT
recorded_with: VCR 6.3.1
